Revit 2027 API
FabricationPart.Notes Property
 The notes of the fabrication part.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string Notes { get; set; }
Public Property Notes As String
	Get
	Set
public:
property String^ Notes {
	String^ get ();
	void set (String^ value);
}
member Notes : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
InvalidOperationException |  When setting this property:
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace